Repository: gitter-badger/macsen
Catalog: Macsen_*.po
Languages: cy

source: I'm sorry. I had some trouble with that operation
cy: Mae’n flin gen i. Cefais broblem gyda' r weithred honno.

source: Please try again later.
cy: Ceisiwch eto yn nes ymlaen.

source: Welcome to the profile populator for language %s
cy: Croeso i'r poblogwr proffil ar gyfer yr iaith %s

source: If, at any step, you'd prefer not to enter the requested information, just hit 'Enter' with a blank field to continue.
cy: Os, ar unrhyw gam, byddai’n well gennych chi beidio rhoi' r wybodaeth ofynnol i mewn, pwyswch ‘Enter’ gyda’r maes yn wag i barhau.

source: Jasper uses your GMail to send notifications.
cy: Gall Jasper ddefnyddio eich cyfrif Gmail i anfon hysbysiadau.

source: Phone number (no country code). Any dashes or spaces will be removed for you:
cy: Rhif ffôn (dim cod gwlad). Bydd unrhyw llinellau toriad neu fylchau yn cael eu tynnu ar eich cyfer:

source: Phone carrier (for sending text notifications).
cy: Darparwr ffôn (ar gyfer anfon hysbysiadau ar ffurf negeseuon testun).

source: Os oes gennych rif ffôn UDA, mae modd i chi roi un o'r canlynol: 'AT&T', 'Verizon', 'T-Mobile' (without the quotes).
cy: Os oes gennych ni rhif ffôn, mae modd i chi roi un o'r canlynol:' yn & yn',''Verizon',' T-Mobile' (heb y dyfynnodau).

source: If your carrier isn't listed or you have an international number, go to http://www.emailtextmessages.com and enter the email suffix for your carrier
cy: Os nad yw eich darparwr yn cael ei ddangos neu bod gennych rif rhyngwladol, ewch i http://www.emailtextmessages.com a rhoi i mewn yr olddodiad e-bost ar gyfer eich darparwr

source: (e.g., for Virgin Mobile, enter 'vmobl.com'; for T-Mobile Germany, enter 't-d1-sms.de').
cy: "(e.e., ar gyfer Virgin Mobile, rhowch 'vmobl.com'; am T-Mobile yr Almaen, rhowch 't-d1-sms.de')).

source: Carrier:
cy: Darparwr:

source: Location saved as
cy: Cadwyd y lleoliad fel

source: Location should be a 5-digit US zipcode (e.g., 08544).
cy: Dylai lleoliad fod yn god post 5-digid yr UDA (e.e., 08544).

source: If you are outside the US, insert the name of your nearest big town/city. For weather requests.
cy: Os ydych yn tu allan i'r UDA, rhowch enw eich tref fawr / dinas agosaf. Caiff ei ddefnyddio ar gyfer ceisiadau tywydd.

source: Location:
cy: Lleoliad:

source: Weather not found. Please try another location.
cy: Heb ddod o hyd i ragolygon tywydd ar gyfer y lleoliad hwnnw. Dewiswch leoliad arall.

source: Please enter a timezone from the list located in the TZ* column at http://en.wikipedia.org/wiki/List_of_tz_database_time_zones, or none at all.
cy: Rhowch gylchfa amser o' r rhestr a geir yn y golofn TZ * yn http://en.wikipedia.org/wiki/List_of_tz_database_time_zones, neu ddim o gwbl.

source: Timezone:
cy: Cylchfa amser:

source: Not a valid timezone. Try again.
cy: Nid yw'n gylchfa amser ddilys. Ceisiwch eto.

source: Would you prefer to have notifications sent by email (E) or text message (T)?
cy: Hoffech chi gael hysbysiadau wedi’u hanfon drwy e-bost (E) neu neges destun (T)?

source: Please choose email (E) or text message (T):
cy: Dewiswch e-bost (E) neu neges destun (T):

source: If you would like to choose a specific STT engine, please specify which.
cy: Os hoffech chi ddewis peiriant STT penodol, nodwch pa un.

source: Available implementations: %s. (Press Enter to default to PocketSphinx):
cy: Gweithrediadau ar gael: %s. (Pwyswch Enter iddo ragosod i PocketSphinx):

source: Please enter your API key:
cy: Rhowch eich API allwedd:

source: Unrecognized STT engine. Available implementations: %s
cy: Peiriant STT heb ei adnabod. Gweithrediadau sydd ar gael: %s

source: Writing to profile...
cy: Ysgrifennu i'r proffil...

source: Done.
cy: Gorffen.

source: How can I be of service, %s?
cy: Sut fedra i helpu, %s?

source: How can I be of service?
cy: Sut fedra i helpu?

source: Macsen Voice Control Center
cy: Canolfan Rheoli Llais Macsen

source: Use text input instead of a real microphone
cy: Defnyddio testun mewnbwn yn lle Meicroffon go iawn

source: Disable the network connection check
cy: Analluogi gwirio'r cysylltiad rhwydwaith

source: Run diagnose and exit
cy: Rhedeg y dadansoddi a gadael

source: Show debug messages
cy: Dangos negeseuon dadfygio

source: MACSEN - THE MULTILINGUAL TALKING COMPUTER *
cy: MACSEN - Y CYFRIFIADUR AMLIEITHOG SY'N SIARAD *

source: Initial Developers: *
cy: Datblygwyr cychwynnol:

source: MACSEN is based on : *
cy: Seiliwyd MACSEN ar : *

source: Speech Recognition Configuration
cy: Ffurfweddiad Adnabod Lleferydd

source: Text-to-Speech Configuration
cy: Ffurfweddiad Testun-i-Leferydd

source: Enter your Ivona access key :
cy: Rhowch eich allwedd mynediad Ivona:

source: Enter your Ivona secret key :
cy: Rhowch eich allwedd gyfrinachol Ivona:

source: Microphone:
cy: Microffon:
